; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-15)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl6)
	(at plane2 city5)
	(fuel-level plane2 fl2)
	(at plane3 city2)
	(fuel-level plane3 fl3)
	(at person1 city14)
	(at person2 city10)
	(at person3 city10)
	(at person4 city15)
	(at person5 city14)
	(at person6 city2)
	(at person7 city13)
	(at person8 city7)
	(at person9 city3)
	(at person10 city4)
	(at person11 city10)
	(at person12 city4)
	(at person13 city9)
	(at person14 city17)
	(at person15 city2)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city10)
	(at person2 city8)
	(at person3 city9)
	(at person4 city14)
	(at person5 city3)
	(at person6 city10)
	(at person7 city12)
	(at person8 city12)
	(at person9 city18)
	(at person10 city7)
	(at person12 city12)
	(at person13 city2)
	(at person14 city18)
	(at person15 city13)
	))

)

; plan
1. (board person6 plane3 city2)
   deleted: (at person6 city2)
   added: (in person6 plane3)
   goals met: 0 of 14
2. (zoom plane3 city2 city10 fl3 fl2 fl1)
   deleted: (at plane3 city2) (fuel-level plane3 fl3)
   added: (at plane3 city10) (fuel-level plane3 fl1)
   goals met: 0 of 14
3. (debark person6 plane3 city10)
   deleted: (in person6 plane3)
   added: (at person6 city10)
   goals met: 1 of 14
4. (board person3 plane3 city10)
   deleted: (at person3 city10)
   added: (in person3 plane3)
   goals met: 1 of 14
5. (board person2 plane3 city10)
   deleted: (at person2 city10)
   added: (in person2 plane3)
   goals met: 1 of 14
6. (zoom plane1 city0 city13 fl6 fl5 fl4)
   deleted: (at plane1 city0) (fuel-level plane1 fl6)
   added: (at plane1 city13) (fuel-level plane1 fl4)
   goals met: 1 of 14
7. (zoom plane1 city13 city14 fl4 fl3 fl2)
   deleted: (at plane1 city13) (fuel-level plane1 fl4)
   added: (at plane1 city14) (fuel-level plane1 fl2)
   goals met: 1 of 14
8. (board person5 plane1 city14)
   deleted: (at person5 city14)
   added: (in person5 plane1)
   goals met: 1 of 14
9. (board person1 plane1 city14)
   deleted: (at person1 city14)
   added: (in person1 plane1)
   goals met: 1 of 14
10. (fly plane3 city10 city8 fl1 fl0)
   deleted: (at plane3 city10) (fuel-level plane3 fl1)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 1 of 14
11. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 1 of 14
12. (debark person2 plane3 city8)
   deleted: (in person2 plane3)
   added: (at person2 city8)
   goals met: 2 of 14
13. (fly plane3 city8 city9 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city9) (fuel-level plane3 fl0)
   goals met: 2 of 14
14. (debark person3 plane3 city9)
   deleted: (in person3 plane3)
   added: (at person3 city9)
   goals met: 3 of 14
15. (board person13 plane3 city9)
   deleted: (at person13 city9)
   added: (in person13 plane3)
   goals met: 3 of 14
16. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 14
17. (fly plane3 city9 city2 fl1 fl0)
   deleted: (at plane3 city9) (fuel-level plane3 fl1)
   added: (at plane3 city2) (fuel-level plane3 fl0)
   goals met: 3 of 14
18. (board person15 plane3 city2)
   deleted: (at person15 city2)
   added: (in person15 plane3)
   goals met: 3 of 14
19. (refuel plane3 city2 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 14
20. (debark person13 plane3 city2)
   deleted: (in person13 plane3)
   added: (at person13 city2)
   goals met: 4 of 14
21. (fly plane3 city2 city13 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 4 of 14
22. (board person7 plane3 city13)
   deleted: (at person7 city13)
   added: (in person7 plane3)
   goals met: 4 of 14
23. (refuel plane3 city13 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 14
24. (debark person15 plane3 city13)
   deleted: (in person15 plane3)
   added: (at person15 city13)
   goals met: 5 of 14
25. (fly plane3 city13 city12 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 5 of 14
26. (debark person7 plane3 city12)
   deleted: (in person7 plane3)
   added: (at person7 city12)
   goals met: 6 of 14
27. (zoom plane2 city5 city15 fl2 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl2)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 6 of 14
28. (board person4 plane2 city15)
   deleted: (at person4 city15)
   added: (in person4 plane2)
   goals met: 6 of 14
29. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 14
30. (zoom plane1 city14 city10 fl2 fl1 fl0)
   deleted: (at plane1 city14) (fuel-level plane1 fl2)
   added: (at plane1 city10) (fuel-level plane1 fl0)
   goals met: 6 of 14
31. (refuel plane1 city10 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 14
32. (debark person1 plane1 city10)
   deleted: (in person1 plane1)
   added: (at person1 city10)
   goals met: 7 of 14
33. (fly plane1 city10 city3 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 7 of 14
34. (board person9 plane1 city3)
   deleted: (at person9 city3)
   added: (in person9 plane1)
   goals met: 7 of 14
35. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 7 of 14
36. (debark person5 plane1 city3)
   deleted: (in person5 plane1)
   added: (at person5 city3)
   goals met: 8 of 14
37. (fly plane1 city3 city17 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city17) (fuel-level plane1 fl0)
   goals met: 8 of 14
38. (refuel plane1 city17 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 14
39. (board person14 plane1 city17)
   deleted: (at person14 city17)
   added: (in person14 plane1)
   goals met: 8 of 14
40. (fly plane1 city17 city18 fl1 fl0)
   deleted: (at plane1 city17) (fuel-level plane1 fl1)
   added: (at plane1 city18) (fuel-level plane1 fl0)
   goals met: 8 of 14
41. (debark person9 plane1 city18)
   deleted: (in person9 plane1)
   added: (at person9 city18)
   goals met: 9 of 14
42. (debark person14 plane1 city18)
   deleted: (in person14 plane1)
   added: (at person14 city18)
   goals met: 10 of 14
43. (fly plane2 city15 city4 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 10 of 14
44. (refuel plane3 city12 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 10 of 14
45. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 14
46. (board person12 plane2 city4)
   deleted: (at person12 city4)
   added: (in person12 plane2)
   goals met: 10 of 14
47. (board person10 plane2 city4)
   deleted: (at person10 city4)
   added: (in person10 plane2)
   goals met: 10 of 14
48. (fly plane3 city12 city7 fl1 fl0)
   deleted: (at plane3 city12) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 10 of 14
49. (board person8 plane3 city7)
   deleted: (at person8 city7)
   added: (in person8 plane3)
   goals met: 10 of 14
50. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 10 of 14
51. (fly plane3 city7 city12 fl1 fl0)
   deleted: (at plane3 city7) (fuel-level plane3 fl1)
   added: (at plane3 city12) (fuel-level plane3 fl0)
   goals met: 10 of 14
52. (debark person8 plane3 city12)
   deleted: (in person8 plane3)
   added: (at person8 city12)
   goals met: 11 of 14
53. (fly plane2 city4 city12 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 11 of 14
54. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 14
55. (debark person12 plane2 city12)
   deleted: (in person12 plane2)
   added: (at person12 city12)
   goals met: 12 of 14
56. (fly plane2 city12 city14 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 12 of 14
57. (refuel plane2 city14 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 12 of 14
58. (debark person4 plane2 city14)
   deleted: (in person4 plane2)
   added: (at person4 city14)
   goals met: 13 of 14
59. (fly plane2 city14 city7 fl1 fl0)
   deleted: (at plane2 city14) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 13 of 14
60. (debark person10 plane2 city7)
   deleted: (in person10 plane2)
   added: (at person10 city7)
   goals met: 14 of 14
